![New York City schoolbus](datasets/schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a maximum score of 800 points. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [1]:
#Import libraries
import pandas as pd

# Read in the data
schools = pd.read_csv("datasets/schools.csv")

# Preview the data
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

## First Question
<p>Create a pandas DataFrame called best_math_schools containing the <code>"school_name"</code> and <code>"average_math"</code> score for all schools where the results are at least 80% of the maximum possible score, sorted by <code>"average_math"</code> in descending order.</p>

In [ ]:
#Schools within 80% of the maximum score (800)
best_math_schools = schools[schools['average_math'] >= 640]
best_math_schools = best_math_schools[['school_name','average_math']].sort_values(by='average_math',ascending = False)
print(best_math_schools.head())

603.2
                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

## Question 2
<p>Identify the top 10 performing schools based on scores across the three SAT sections, storing as a pandas DataFrame called <code>"top_10_schools"</code> containing the school name and a column named <code>"total_SAT"</code>, with results sorted by total_SAT in descending order.</p>

In [3]:
schools['total_SAT'] = schools['average_math'] + schools['average_writing'] + schools['average_reading']
top_10_schools = schools.groupby('school_name', as_index=False)['total_SAT'].mean().sort_values('total_SAT', ascending=False).head(10)
top_10_schools

                                           school_name  total_SAT
325                             Stuyvesant High School     2144.0
324                Staten Island Technical High School     2041.0
55                        Bronx High School of Science     2041.0
188  High School of American Studies at Lehman College     2013.0
334                        Townsend Harris High School     1981.0
293  Queens High School for the Sciences at York Co...     1947.0
30                      Bard High School Early College     1914.0
83                      Brooklyn Technical High School     1896.0
121                      Eleanor Roosevelt High School     1889.0
180  High School for Mathematics, Science, and Engi...     1889.0

## Question 3
<p>Locate the NYC borough with the largest standard deviation for <code>"total_SAT"</code>, storing as a DataFrame called <code>largest_std_dev</code> with <code>"borough"</code> as the index and three columns: <code>"num_schools"</code> for the number of schools in the borough, <code>"average_SAT"</code> for the mean of <code>"total_SAT"</code>, and <code>"std_SAT"</code> for the standard deviation of <code>"total_SAT"</code>. Round all numeric values to two decimal places.</p>

In [4]:
boroughs = schools.groupby("borough")["total_SAT"].agg(["count", "mean", "std"]).round(2)
largest_std_dev = boroughs[boroughs['std'] == boroughs['std'].max()]
changes = {'count' : 'num_schools','mean':'average_SAT','std':'std_SAT'}
largest_std_dev = largest_std_dev.rename(columns=changes)
largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29